;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
;; (package! zmq)
;; (package! websocket)
;; (package! simple-httpd)
;; (package! jupyter)
(package! exec-path-from-shell)
(package! julia-repl :pin "7ce38a9caf2a9c105afe66f464a2f30e816d69f3")
;;(package! elpy)
;;(package! turnip)
(package! lsp-julia)
(package! org-bullets)
(package! org-fancy-priorities)
(package! org-super-agenda)
(package! move-text)
(package! origami)
(package! deadgrep)
(package! sql-indent)
(package! eterm-256color)
(package! lsp-julia)
