;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! zmq)
(package! websocket)
(package! simple-httpd)
(package! jupyter)
(package! exec-path-from-shell)
(package! pyenv-mode)
(package! mustache)
(package! julia-repl)
;;(package! elpy)
(package! turnip)
